{
  "run_id": "RUN_20260204_132700_1fed028ce5fb",
  "timestamp": "2026-02-04T14:36:04.883785",
  "document": "01_Article_Iptacopan C3G Trial.pdf",
  "document_path": "/Users/frederictetard/Projects/ese/gold_data/PAPERS/01_Article_Iptacopan C3G Trial.pdf",
  "total_candidates": 613,
  "total_validated": 31,
  "total_rejected": 0,
  "total_ambiguous": 0,
  "heuristics_counters": {
    "recovered_by_stats_whitelist": 4,
    "recovered_by_country_code": 0,
    "recovered_by_hyphen": 5,
    "recovered_by_direct_search": 3,
    "recovered_by_llm_sf_only": 1,
    "blacklisted_fp_count": 28,
    "common_word_rejected": 14,
    "context_rejected": 0,
    "form_filter_rejected": 36,
    "trial_id_excluded": 1
  },
  "abbreviations": [
    {
      "short_form": "CI",
      "long_form": "confidence interval",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "oup discontinued treatment during the open-label period. The 24-h UPCR percentage change relative to baseline at 6 months was -30-2% (95% CI-42-8 to -14-8) in the iptacopan group and 7-6% (-11-9 to 31-3) in the placebo group. In the iptacopan group, the geometric mean of 24-h UPCR was 3-33 g/g (95% CI 2-79 to 3-97) at baseline and 2-17 g/g (1-62 to 2-91) at 6 months; in the placebo group, this was 2-58 g/g (2-18 to 3-05) at baseline and 2-80 g/g (2-37 to 3-30) at 6 months. The primary endpoint was met with a relative reduction in 24-h UPCR at 6 months for iptacopan versus placebo of 35-1% (13-8",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "SD",
      "long_form": "standard deviation",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 4,
      "context_text": "Iptacopan 200 m_ Placebo (n=38) (n=36) Age (years), mean (SD) 26-1 (1039) 29-8 (10-79) Sex Male 27 (71%) 20 (56%) Female 11 (29%) 16 (44%) Race White 27 (71%) 24 (67%) Black or African American 1(3%) 1(3%) Asian 9 (24%) 9 (25%) American Indian or 0 13%) Alaska Native Multiple 0 1(3%) Weiaerm eR) o Region North America 7 (18%) 8 (22%) Europe 22 (58%) 19(53%)",
      "lexicon_source": "2025_08_umls_biological_abbreviations_v5.tsv",
      "lexicon_ids": [
        {
          "source": "UMLS:MTH",
          "id": "SD"
        }
      ]
    },
    {
      "short_form": "LNP023",
      "long_form": "iptacopan",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "in patients with C3 glomerulopathy: a randomised, double-blind, parallel group, multicentre, placebo-controlled, phase 3 study @k® CrossMark Background C3 glomerulopathy is an ultra-rare, severe form of glomerulonephritis caused by overactivation of the alternative complement pathway. We aimed to assess efficacy and safety of iptacopan (LNP023), an oral, proximal complement inhibitor that targets factor B to selectively inhibit the alternative pathway of the complement cascade.",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "UPCR",
      "long_form": "urine protein creatinine ratio",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "aldosterone system (RAAS) inhibitors] and immunosuppression). Adult participants (aged 18-60 years) with biopsy-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0-85 xlower limit of the central laboratory normal range}) at screening, urine protein— creatinine ratio (UPCR) of 1-0 g/g or higher at day —-75 and day —15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1-73 m2 or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatmen",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "eGFR",
      "long_form": "estimated glomerular filtration rate",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "-confirmed C3 glomerulopathy were enrolled from 35 hospitals or medical centres in 18 countries. Inclusion criteria included reduced serum C3 concentration (ie, <77 mg/dL [defined as <0-85 xlower limit of the central laboratory normal range}) at screening, urine protein— creatinine ratio (UPCR) of 1-0 g/g or higher at day —-75 and day —15 before randomisation, estimated glomerular filtration rate (eGFR) of 30 mL/min per 1-73 m2 or higher at screening and day -15, and vaccination against Neisseria meningitidis and Streptococcus pneumoniae. All eligible participants were randomised 1:1 via interactive response technology to either the iptacopan or the placebo group, stratified by treatment with corticosteroids, mycophenolic acid, or both (yes or no). During the 6-month double-blind period, partici",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "RAAS",
      "long_form": "renin angiotensin aldosterone system",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "he approval of iptacopan (FABHALTA) for C3 glomerulopathy by the US Food and Drug Administration (FDA) and the European Medicines Agency (EMA) in 2025,’ there were no treatment options for C3 glomerulopathy that target the underlying disease pathogenesis. Current guideline recommendations for C3 glomerulopathy rely on supportive treatments—eg, blockade of the renin— angiotensin—aldosterone system (RAAS) — with angiotensin-converting enzyme inhibitors or",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "SGLT2",
      "long_form": "sodiumglucose cotransporter-2",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 3,
      "context_text": "sm of action of iptacopan.” In this study, we aimed to evaluate the efficacy, safety, and tolerability of iptacopan compared with placebo in (ie, <7-5 mg) corticosteroids, sodium-glucose cotransporter-2 (SGLT2) inhibitors, and mineralocorticoid receptor antagonists were allowed when stable for at least 90 days before randomisation. Demographic data on race (White, Black or African American, Asian, Chinese, Indian, Japanese, Korean, Vietnamese, Native Hawaiian or other Pacific Islander, American Indian, or Alaska Native), ethnicity (Hispanic or Latino, not Hispanic or Latino, not reported, or unknown), a",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "RR",
      "long_form": "relative reduction",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 5,
      "context_text": "Data are presented for the full analysis set (ie, all participants to whom study treatment was assigned by randomisation). (A) The model estimated geometric mean of the ratio to baseline in percentage change (95% Cl) of UPCR 24 h (g/g) at month 6 by treatment group (full analysis set). (B) Plot of percentage change (95% Cl) of 24h UPCR (g/g), up to month 12 by treatment group (full analysis set). RR=relative reduction. UPCR=urine protein-creatinine ratio. *Based on the analysis using the combined full analysis set (ie, all participants to whom study treatment was assigned by randomisation).",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "OR",
      "long_form": "odds ratio",
      "confidence": 0.95,
      "field_type": "DEFINITION_PAIR",
      "page": 6,
      "context_text": "Data are presented for the full analysis set (ie, all participants to whom study treatment was assigned by randomisation). eGFR=estimated glomerular filtration rate. OR=odds ratio. UPCR=urine protein-creatinine ratio. “Statistically significant after adjustment for multiple testing. t12 months of treatment in those randomised initially to iptacopan and 6 months iptacopan treatment in those randomised initially to placebo.",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "C3G",
      "long_form": "C3 glomerulopathy",
      "confidence": 1.0,
      "field_type": "DEFINITION_PAIR",
      "page": 11,
      "context_text": "th RJH, Appel GB, Blom AM, et al. C3 glomerulopathy— understanding a rare complement-driven renal disease. Nat Rev Nephrol 2019; 15: 129-43. 26 Downward L, Wong K, Proudfoot C, Webb NJA, Wong E, Gale D. Patient characteristics and renal outcomes of C3 glomerulopathy (C3G) and immune complex membranoproliferative glomerulonephritis (IC-MPGN) in the UK: a retrospective analysis of 287 patients in the UK National Registry of Rare Kidney Diseases (RaDaR). J Am Soc Nephrol 2023; 34 (11S): S271-72.",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "IC-MPGN",
      "long_form": "immune complex membranoproliferative glomerulonephritis",
      "confidence": 1.0,
      "field_type": "DEFINITION_PAIR",
      "page": 11,
      "context_text": "th RJH, Appel GB, Blom AM, et al. C3 glomerulopathy— understanding a rare complement-driven renal disease. Nat Rev Nephrol 2019; 15: 129-43. 26 Downward L, Wong K, Proudfoot C, Webb NJA, Wong E, Gale D. Patient characteristics and renal outcomes of C3 glomerulopathy (C3G) and immune complex membranoproliferative glomerulonephritis (IC-MPGN) in the UK: a retrospective analysis of 287 patients in the UK National Registry of Rare Kidney Diseases (RaDaR). J Am Soc Nephrol 2023; 34 (11S): S271-72.",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "KDIGO",
      "long_form": "Kidney Disease Improving Global Outcomes",
      "confidence": 1.0,
      "field_type": "DEFINITION_PAIR",
      "page": 11,
      "context_text": "rulopathy and immune-complex membranoproliferative glomerulonephritis using the United Kingdom RaDaR Registry. Kidney Int 2025; 108: 455-69. 6 Vivarelli M, Barratt J, Beck LH Jr, et al. The role of complement in kidney disease: conclusions from a Kidney Disease: Improving Global Outcomes (KDIGO) Controversies Conference. Kidney Int 2024; 106: 369-91.",
      "lexicon_source": null,
      "lexicon_ids": null
    },
    {
      "short_form": "RaDaR",
      "long_form": "National Registry of Rare Kidney Diseases (RaDaR)",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 10,
      "context_text": "The pretreatment slope is consistent with the natural history of C3 glomerulopathy: up to 50% of patients progress to kidney failure over 10 years.’? Furthermore, the pretreatment slope in the APPEAR-C3G population is consistent with real-world data on the rate of decline in eGFR in the GLOSEN and RaDaR studies.**” In addition, the data from RaDaR and GLOSEN suggest that the stabilisation of eGFR slope achieved with iptacopan would be expected to decrease the risk of kidney failure in C3 glomerulopathy.*”",
      "lexicon_source": "trial_acronyms_lexicon.json",
      "lexicon_ids": [
        {
          "source": "ClinicalTrials.gov",
          "id": "NCT06065852"
        }
      ]
    },
    {
      "short_form": "C3",
      "long_form": "Complement Component 3",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "C3 glomerulopathy is an ultra-rare and severe form of primary chronic glomerulonephritis with an estimated",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "C5",
      "long_form": "Complement Component 5",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "ften considerable side-effects. Iptacopan is an oral complement inhibitor that targets factor B and selectively inhibits the alternative pathway by blocking C3 convertase activity and inhibiting the alternative pathway amplification loop, thus preventing downstream generation of alternative pathway C5 convertase, C3a and C5a anaphylatoxins, and the membrane attack complex. Iptacopan is also approved for the treatment of adults with paroxysmal nocturnal haemoglobinuria and for the reduction of proteinuria in adults with primary IgA nephropathy. In a phase 2 study, 12-week iptacopan treatment resu",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "C5a",
      "long_form": "Complement Component 5A",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "effects. Iptacopan is an oral complement inhibitor that targets factor B and selectively inhibits the alternative pathway by blocking C3 convertase activity and inhibiting the alternative pathway amplification loop, thus preventing downstream generation of alternative pathway C5 convertase, C3a and C5a anaphylatoxins, and the membrane attack complex. Iptacopan is also approved for the treatment of adults with paroxysmal nocturnal haemoglobinuria and for the reduction of proteinuria in adults with primary IgA nephropathy. In a phase 2 study, 12-week iptacopan treatment resulted in proteinuria redu",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "IgA",
      "long_form": "Immunoglobulin A",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "loop, thus preventing downstream generation of alternative pathway C5 convertase, C3a and C5a anaphylatoxins, and the membrane attack complex. Iptacopan is also approved for the treatment of adults with paroxysmal nocturnal haemoglobinuria and for the reduction of proteinuria in adults with primary IgA nephropathy. In a phase 2 study, 12-week iptacopan treatment resulted in proteinuria reduction and stabilisation of estimated glomerular filtration rate (eGFR) in patients with C3 glomerulopathy. These effects persisted 9 months later, when assessed as part of the extension study. The improvements",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "C3a",
      "long_form": "complement 3a",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "le side-effects. Iptacopan is an oral complement inhibitor that targets factor B and selectively inhibits the alternative pathway by blocking C3 convertase activity and inhibiting the alternative pathway amplification loop, thus preventing downstream generation of alternative pathway C5 convertase, C3a and C5a anaphylatoxins, and the membrane attack complex. Iptacopan is also approved for the treatment of adults with paroxysmal nocturnal haemoglobinuria and for the reduction of proteinuria in adults with primary IgA nephropathy. In a phase 2 study, 12-week iptacopan treatment resulted in proteinu",
      "lexicon_source": "meta-inventory",
      "lexicon_ids": null
    },
    {
      "short_form": "AT1",
      "long_form": "angiotensin receptor 1",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 2,
      "context_text": "atment of adult patients with C3 glomerulopathy by both the US Food and Drug Administration and the European Medicines Agency in 2025. Current guideline recommendations rely on supportive care (ie, blockade of the renin-angiotensin-aldosterone system with angiotensin-converting enzyme inhibitors or AT1 receptor blockers) with or without immunosuppression (eg, mycophenolic mofetil or corticosteroids), which has limited benefits and often considerable side-effects. Iptacopan is an oral complement inhibitor that targets factor B and selectively inhibits the alternative pathway by blocking C3 convert",
      "lexicon_source": "meta-inventory",
      "lexicon_ids": null
    },
    {
      "short_form": "CKD",
      "long_form": "chronic kidney disease",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 8,
      "context_text": "Historical serum creatinine data over the 2 years efore study randomisation were systematically collected for all 74 participants and were used to calculate eGFR using the CKD-EPI formula (appendix 7), consistent with the calculation of eGFR during the study. These data allowed a robust comparison of the annualised eGFR slope before the initiation of iptacopan treatment and the slope after the start of treatment. In the prespecified analysis (appendix p 11, 199, 221), th",
      "lexicon_source": "2025_mondo_diseases.json",
      "lexicon_ids": [
        {
          "source": "MONDO",
          "id": "MONDO_0005300"
        },
        {
          "source": "DOID",
          "id": "DOID:784"
        },
        {
          "source": "EFO",
          "id": "EFO:0003884"
        },
        {
          "source": "ICD10CM",
          "id": "ICD10CM:N18"
        },
        {
          "source": "ICD10CM",
          "id": "ICD10CM:N18.9"
        },
        {
          "source": "ICD10WHO",
          "id": "ICD10WHO:N18"
        },
        {
          "source": "ICD9",
          "id": "ICD9:585"
        },
        {
          "source": "ICD9",
          "id": "ICD9:585.6"
        },
        {
          "source": "MEDGEN",
          "id": "MEDGEN:473458"
        },
        {
          "source": "MESH",
          "id": "MESH:D007676"
        },
        {
          "source": "NANDO",
          "id": "NANDO:2100008"
        },
        {
          "source": "NANDO",
          "id": "NANDO:2100023"
        },
        {
          "source": "NCIT",
          "id": "NCIT:C80078"
        },
        {
          "source": "SCTID",
          "id": "SCTID:709044004"
        },
        {
          "source": "UMLS",
          "id": "UMLS:C1561643"
        },
        {
          "source": "icd11.foundation",
          "id": "icd11.foundation:412389819"
        }
      ]
    },
    {
      "short_form": "GFR",
      "long_form": "glomerular filtration rate",
      "confidence": 0.9,
      "field_type": "DEFINITION_PAIR",
      "page": 10,
      "context_text": "portant limitations to the study findings. The mean change in eGFR did not achieve statistical significance, probably due to the reserved eGFR in the study population at baseline and the hort double-blind period (see appendix p 7 for further letails on the rationale for study design). The change in GFR from pretreatment to post-treatment provides an ternative method of evaluating the benefit of iptacopan, though the pretreatment eGFR values are based nm historical creatinine values collecte fore study nrolment. The eGFR slope analysis by treatment group howed that the iptacopan group had stabilis",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "MPGN",
      "long_form": "Membranoproliferative Glomerulonephritis",
      "confidence": 0.8,
      "field_type": "DEFINITION_PAIR",
      "page": 11,
      "context_text": "26 Downward L, Wong K, Proudfoot C, Webb NJA, Wong E, Gale D. Patient characteristics and renal outcomes of C3 glomerulopathy (C3G) and immune complex membranoproliferative glomerulonephritis (IC-MPGN) in the UK: a retrospective analysis of 287 patients in the UK National Registry of Rare Kidney Diseases (RaDaR). J Am Soc Nephrol 2023; 34 (11S): S271-72.",
      "lexicon_source": "2025_08_abbreviation_general.json",
      "lexicon_ids": null
    },
    {
      "short_form": "APPEAR-C3G",
      "long_form": "A Multicenter, Randomized, Double-blind, Parallel Group, Placebo-controlled Study to Evaluate the Efficacy and Safety of Iptacopan (LNP023) in Complement 3 Glomerulopathy.",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "ngelo J Trapani, Nicholas J A Webb, Matthias Meier, Ruben K Israni, Richard J H Smith, on behalf of APPEAR-C3G investigatorst Funding Novartis Pharma. Introduction C3 glomerulopathy is an ultra-rare and severe ",
      "lexicon_source": "orchestrator:hyphenated",
      "lexicon_ids": null
    },
    {
      "short_form": "CKD-EPI",
      "long_form": "Chronic Kidney Disease Epidemiology Collaboration",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "ion were systematically collected for all 74 participants and were used to calculate eGFR using the CKD-EPI formula (appendix 7), consistent with the calculation of eGFR during the study. These data allowed ",
      "lexicon_source": "orchestrator:hyphenated",
      "lexicon_ids": null
    },
    {
      "short_form": "FACIT",
      "long_form": "Functional Assessment of Chronic Illness Therapy",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": " renal biopsy at 6 months) and on patient-reported fatigue (change from baseline to 6 months in the FACIT-Fatigue score), and to evaluate the safety profile and tolerability of iptacopan compared with plac",
      "lexicon_source": "orchestrator:hyphenated",
      "lexicon_ids": null
    },
    {
      "short_form": "FACIT-Fatigue",
      "long_form": "Functional Assessment of Chronic Illness Therapy-Fatigue",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": " renal biopsy at 6 months) and on patient-reported fatigue (change from baseline to 6 months in the FACIT-Fatigue score), and to evaluate the safety profile and tolerability of iptacopan compared with placebo duri",
      "lexicon_source": "orchestrator:hyphenated",
      "lexicon_ids": null
    },
    {
      "short_form": "sC5b-9",
      "long_form": "soluble terminal complement complex",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "y methodology is available in the appendix (pp 7-8). baseline in log-transformed plasma and urinary sC5b-9 at 6 months). For the open-label period, the primary outcome was to evaluate the effect of iptacopa",
      "lexicon_source": "orchestrator:hyphenated",
      "lexicon_ids": null
    },
    {
      "short_form": "FABHALTA",
      "long_form": "iptacopan (brand name)",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "ed 9 months later, when assessed as part of the extension study.” Before the approval of iptacopan (FABHALTA) for C3 glomerulopathy by the US Food and Drug Administration (FDA) and the European Medicines Agen",
      "lexicon_source": "orchestrator:direct_search",
      "lexicon_ids": null
    },
    {
      "short_form": "GLOSEN",
      "long_form": "Spanish Glomerulonephritis Study Group",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "e progression and lower the risk of kidney failure in C3 glomerulopathy.*” For example, the Spanish GLOSEN registry data showed that a reduction in UPCR at 6 months or 12 months predicted a reduction in the",
      "lexicon_source": "orchestrator:direct_search",
      "lexicon_ids": null
    },
    {
      "short_form": "SAS",
      "long_form": "Statistical Analysis System",
      "confidence": 0.85,
      "field_type": "DEFINITION_PAIR",
      "page": 1,
      "context_text": "s methods are available in the appendix (pp 8-11, 23). All statistical analyses were performed with SAS (version 9.4). An independent data monitoring committee was established and routinely reviewed unbl",
      "lexicon_source": "orchestrator:direct_search",
      "lexicon_ids": null
    },
    {
      "short_form": "NCT04817618",
      "long_form": "A Multicenter, Randomized, Double-blind, Parallel Group, Placebo-controlled Study to Evaluate the Efficacy and Safety of Iptacopan (LNP023) in Complement 3 Glomerulopathy.",
      "confidence": 0.75,
      "field_type": "SHORT_FORM_ONLY",
      "page": 1,
      "context_text": " treatment were included in the safety analysis. This trial was registered with ClinicalTrials.gov (NCT04817618) and the adult cohort has been completed. Findings Between July 28, 2021, and Feb 15, 2023, 132 par",
      "lexicon_source": "orchestrator:llm_extraction",
      "lexicon_ids": null
    }
  ],
  "diseases": [
    {
      "name": "Immune complex membranoproliferative glomerulonephritis",
      "matched_text": "immune complex membranoproliferative glomerulonephritis",
      "abbreviation": "IC-MPGN",
      "confidence": 0.9500000000000001,
      "is_rare": false,
      "icd10": "N03.5",
      "orpha": null
    },
    {
      "name": "monoclonal gammopathy of undetermined significance",
      "matched_text": "monoclonal gammopathy of undetermined significance",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "Mucopolysaccharidosis type 2, severe form",
      "matched_text": "severe form",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": true,
      "icd10": null,
      "orpha": "ORPHA:217085"
    },
    {
      "name": "membranoproliferative glomerulonephritis",
      "matched_text": "membranoproliferative glomerulonephritis",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:54370"
    },
    {
      "name": "Epilepsy with eyelid myoclonia",
      "matched_text": "EMA",
      "abbreviation": "EMA",
      "confidence": 0.95,
      "is_rare": true,
      "icd10": "G40.3",
      "orpha": "ORPHA:139431"
    },
    {
      "name": "crescentic glomerulonephritis",
      "matched_text": "crescentic glomerulonephritis",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:280569"
    },
    {
      "name": "Immunoglobulin A nephropathy",
      "matched_text": "IgA nephropathy",
      "abbreviation": "IgAN",
      "confidence": 1.0,
      "is_rare": true,
      "icd10": "N02",
      "orpha": "ORPHA:34145"
    },
    {
      "name": "IgA glomerulonephritis",
      "matched_text": "primary IgA nephropathy",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:34145"
    },
    {
      "name": "Chronic Kidney Disease",
      "matched_text": "CKD",
      "abbreviation": "CKD",
      "confidence": 0.95,
      "is_rare": true,
      "icd10": "N18.9",
      "orpha": null
    },
    {
      "name": "pneumococcal infection",
      "matched_text": "pneumococcal infection",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "Dense deposit disease",
      "matched_text": "Dense deposit disease",
      "abbreviation": "DDD",
      "confidence": 1.0,
      "is_rare": true,
      "icd10": "N03.6",
      "orpha": "ORPHA:93571"
    },
    {
      "name": "C3 glomerulonephritis",
      "matched_text": "C3 glomerulonephritis",
      "abbreviation": "C3GN",
      "confidence": 1.0,
      "is_rare": true,
      "icd10": "N03.6",
      "orpha": "ORPHA:329903"
    },
    {
      "name": "hypertensive disorder",
      "matched_text": "hypertension",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": "ICD10CM:I15",
      "orpha": null
    },
    {
      "name": "kidney inflammation",
      "matched_text": "kidney inflammation",
      "abbreviation": null,
      "confidence": 0.85,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "acute kidney injury",
      "matched_text": "Acute kidney injury",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": "ICD10CM:N17",
      "orpha": null
    },
    {
      "name": "glomerulonephritis",
      "matched_text": "glomerulonephritis",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "Balkan nephropathy",
      "matched_text": "BEN",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": "ICD10CM:N15.0",
      "orpha": null
    },
    {
      "name": "C3 glomerulopathy",
      "matched_text": "C3G",
      "abbreviation": "C3G",
      "confidence": 1.0,
      "is_rare": true,
      "icd10": "N03.6",
      "orpha": "ORPHA:329918"
    },
    {
      "name": "Menkes disease",
      "matched_text": "MD",
      "abbreviation": "MD",
      "confidence": 0.6,
      "is_rare": true,
      "icd10": "E83.0",
      "orpha": "ORPHA:565"
    },
    {
      "name": "kidney disease",
      "matched_text": "kidney disease",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "kidney failure",
      "matched_text": "kidney failure",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "glomerulopathy",
      "matched_text": "glomerulopathy",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": "ICD10CM:N00-N08",
      "orpha": "Orphanet:93548"
    },
    {
      "name": "rare disease",
      "matched_text": "rare disease",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "proteinuria",
      "matched_text": "proteinuria",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": "ICD10CM:R80",
      "orpha": null
    },
    {
      "name": "meningitis",
      "matched_text": "meningitis",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "condition",
      "matched_text": "condition",
      "abbreviation": null,
      "confidence": 0.65,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:377788"
    },
    {
      "name": "Hepatitis",
      "matched_text": "hepatitis",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "infection",
      "matched_text": "infection",
      "abbreviation": null,
      "confidence": 0.85,
      "is_rare": false,
      "icd10": "ICD10CM:A00-B99",
      "orpha": null
    },
    {
      "name": "injury",
      "matched_text": "injury",
      "abbreviation": null,
      "confidence": 0.85,
      "is_rare": false,
      "icd10": null,
      "orpha": null
    },
    {
      "name": "MARCH",
      "matched_text": "March",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:500135"
    },
    {
      "name": "SAS",
      "matched_text": "SAS",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:576278"
    },
    {
      "name": "CMn",
      "matched_text": "CMN",
      "abbreviation": null,
      "confidence": 0.95,
      "is_rare": false,
      "icd10": null,
      "orpha": "Orphanet:2665"
    }
  ],
  "drugs": [
    {
      "name": "LNP023",
      "matched_text": "LNP023",
      "compound_id": "LNP023",
      "confidence": 0.8,
      "is_investigational": true,
      "phase": null
    },
    {
      "name": "Iptacopan",
      "matched_text": "iptacopan",
      "compound_id": null,
      "confidence": 0.85,
      "is_investigational": true,
      "phase": "RECRUITING"
    },
    {
      "name": "corticosteroids",
      "matched_text": "corticosteroids",
      "compound_id": null,
      "confidence": 0.85,
      "is_investigational": true,
      "phase": "NOT_YET_RECRUITING"
    },
    {
      "name": "Mycophenolic acid",
      "matched_text": "mycophenolic acid",
      "compound_id": null,
      "confidence": 0.85,
      "is_investigational": true,
      "phase": "RECRUITING"
    },
    {
      "name": "Pegcetacoplan",
      "matched_text": "pegcetacoplan",
      "compound_id": null,
      "confidence": 0.85,
      "is_investigational": true,
      "phase": "RECRUITING"
    },
    {
      "name": "iptacopan hydrochloride",
      "matched_text": "FABHALTA",
      "compound_id": null,
      "confidence": 0.7,
      "is_investigational": false,
      "phase": null
    },
    {
      "name": "Empaveli",
      "matched_text": "EMPAVELI",
      "compound_id": null,
      "confidence": 0.7,
      "is_investigational": false,
      "phase": null
    }
  ],
  "pharma": [
    {
      "name": "Novartis",
      "matched_text": "Novartis",
      "full_name": "Novartis AG",
      "headquarters": "Basel, Switzerland",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Gyroscope Therapeutics",
      "matched_text": "Gyroscope Therapeutics",
      "full_name": "Gyroscope Therapeutics Limited",
      "headquarters": "London, UK",
      "parent_company": "Novartis",
      "confidence": 0.95
    },
    {
      "name": "Achillion Pharmaceuticals",
      "matched_text": "Achillion",
      "full_name": "Achillion Pharmaceuticals, Inc.",
      "headquarters": "New Haven, Connecticut, USA",
      "parent_company": "Alexion",
      "confidence": 0.95
    },
    {
      "name": "Alexion",
      "matched_text": "Alexion",
      "full_name": "Alexion Pharmaceuticals",
      "headquarters": "Boston, USA",
      "parent_company": "AstraZeneca",
      "confidence": 0.95
    },
    {
      "name": "AstraZeneca",
      "matched_text": "AstraZeneca",
      "full_name": "AstraZeneca PLC",
      "headquarters": "Cambridge, UK",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Catalyst Biosciences",
      "matched_text": "Catalyst",
      "full_name": "Catalyst Biosciences, Inc.",
      "headquarters": "South San Francisco, California, USA",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "ChemoCentryx",
      "matched_text": "Chemocentryx",
      "full_name": "ChemoCentryx, Inc.",
      "headquarters": "San Carlos, California, USA",
      "parent_company": "Amgen",
      "confidence": 0.95
    },
    {
      "name": "Roche",
      "matched_text": "Roche",
      "full_name": "F. Hoffmann-La Roche AG",
      "headquarters": "Basel, Switzerland",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Silence Therapeutics",
      "matched_text": "Silence Therapeutics",
      "full_name": "Silence Therapeutics plc",
      "headquarters": "London, UK",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "GlaxoSmithKline",
      "matched_text": "GSK",
      "full_name": "GlaxoSmithKline plc",
      "headquarters": "London, UK",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Amgen",
      "matched_text": "Amgen",
      "full_name": "Amgen Inc.",
      "headquarters": "Thousand Oaks, California, USA",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Bayer",
      "matched_text": "Bayer",
      "full_name": "Bayer AG",
      "headquarters": "Leverkusen, Germany",
      "parent_company": null,
      "confidence": 0.95
    },
    {
      "name": "Vertex Pharmaceuticals",
      "matched_text": "Vertex",
      "full_name": "Vertex Pharmaceuticals Incorporated",
      "headquarters": "Boston, Massachusetts, USA",
      "parent_company": null,
      "confidence": 0.95
    }
  ]
}